{
  "architecture": {
    "backend": "tensorflow",
    "class_name": "Model",
    "config": {
      "input_layers": [
        [
          "input_1",
          0,
          0
        ],
        [
          "input_2",
          0,
          0
        ]
      ],
      "layers": [
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              1,
              3,
              1
            ],
            "dtype": "float32",
            "name": "input_1",
            "sparse": false
          },
          "inbound_nodes": [],
          "name": "input_1"
        },
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              1,
              1
            ],
            "dtype": "float32",
            "name": "input_2",
            "sparse": false
          },
          "inbound_nodes": [],
          "name": "input_2"
        },
        {
          "class_name": "GRU",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "dropout": 0.0,
            "dtype": "float32",
            "go_backwards": false,
            "implementation": 2,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "name": "gru_1",
            "recurrent_activation": "sigmoid",
            "recurrent_constraint": null,
            "recurrent_dropout": 0.0,
            "recurrent_initializer": {
              "class_name": "Orthogonal",
              "config": {
                "gain": 1.0,
                "seed": null
              }
            },
            "recurrent_regularizer": null,
            "reset_after": true,
            "return_sequences": true,
            "return_state": false,
            "stateful": true,
            "time_major": false,
            "trainable": true,
            "units": 1,
            "unroll": false,
            "use_bias": false
          },
          "inbound_nodes": [
            [
              [
                "input_1",
                0,
                0,
                {}
              ],
              [
                "input_2",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "gru_1"
        }
      ],
      "name": "model_1",
      "output_layers": [
        [
          "gru_1",
          0,
          0
        ]
      ]
    },
    "keras_version": "2.2.4-tf"
  },
  "hash": "44a8a354a751d968e3ee788e2dbc8965f69f57950e669fba2348e6aada45cf3a",
  "image_data_format": "channels_last",
  "input_shapes": [
    [
      3,
      1
    ],
    [
      1
    ]
  ],
  "output_shapes": [
    [
      3,
      1
    ]
  ],
  "tests": [
    {
      "inputs": [
        {
          "shape": [
            3,
            1
          ],
          "values": [
            "E36Bv7sgHr9uMb69"
          ]
        },
        {
          "shape": [
            1
          ],
          "values": [
            "4emBPQ=="
          ]
        }
      ],
      "outputs": [
        {
          "shape": [
            3,
            1
          ],
          "values": [
            "RooRwD9kBcBLy8i/"
          ]
        }
      ]
    }
  ],
  "trainable_params": {
    "gru_1": {
      "recurrent_weights": [
        "AAAAvwAAAEDNzIy/"
      ],
      "weights": [
        "AACAPwAAAMAAAEBA"
      ]
    }
  }
}
